user_tutorial/fluidOptFoam/fluidOpt_bend_90deg/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;
mergeType points;
checkFaceCorrespondence false;

vertices
(
    
    (0.00000000 0.00000000 -0.10000000) // 0
    (5.00000000 0.00000000 -0.10000000) // 1
    (5.00000000 5.00000000 -0.10000000) // 2
    (0.00000000 5.00000000 -0.10000000) // 3
    (0.00000000 0.00000000 0.00000000) // 4
    (5.00000000 0.00000000 0.00000000) // 5
    (5.00000000 5.00000000 0.00000000) // 6
    (0.00000000 5.00000000 0.00000000) // 7
    (5.00000000 -5.00000000 -0.10000000) // 8
    (30.00000000 -5.00000000 -0.10000000) // 9
    (30.00000000 0.00000000 -0.10000000) // 10
    (5.00000000 -5.00000000 0.00000000) // 11
    (30.00000000 -5.00000000 0.00000000) // 12
    (30.00000000 0.00000000 0.00000000) // 13
    (35.00000000 -5.00000000 -0.10000000) // 14
    (35.00000000 0.00000000 -0.10000000) // 15
    (35.00000000 -5.00000000 0.00000000) // 16
    (35.00000000 0.00000000 0.00000000) // 17
    (40.00000000 -5.00000000 -0.10000000) // 18
    (40.00000000 0.00000000 -0.10000000) // 19
    (40.00000000 -5.00000000 0.00000000) // 20
    (40.00000000 0.00000000 0.00000000) // 21
    (30.00000000 5.00000000 -0.10000000) // 22
    (30.00000000 5.00000000 0.00000000) // 23
    (35.00000000 5.00000000 -0.10000000) // 24
    (35.00000000 5.00000000 0.00000000) // 25
    (40.00000000 5.00000000 -0.10000000) // 26
    (40.00000000 5.00000000 0.00000000) // 27
    (30.00000000 30.00000000 -0.10000000) // 28
    (5.00000000 30.00000000 -0.10000000) // 29
    (30.00000000 30.00000000 0.00000000) // 30
    (5.00000000 30.00000000 0.00000000) // 31
    (35.00000000 30.00000000 -0.10000000) // 32
    (35.00000000 30.00000000 0.00000000) // 33
    (40.00000000 30.00000000 -0.10000000) // 34
    (40.00000000 30.00000000 0.00000000) // 35
    (35.00000000 35.00000000 -0.10000000) // 36
    (30.00000000 35.00000000 -0.10000000) // 37
    (35.00000000 35.00000000 0.00000000) // 38
    (30.00000000 35.00000000 0.00000000) // 39
);

blocks
(
    hex ( 0 1 2 3 4 5 6 7 )
    zone_fluid (51 51 1)  simpleGrading (1 1 1) // 0

    hex ( 8 9 10 1 11 12 13 5 )
    (251 51 1)  simpleGrading (1 1 1) // 1
    
    hex ( 9 14 15 10 12 16 17 13 )
    (51 51 1)  simpleGrading (1 1 1) // 2
    
    hex ( 14 18 19 15 16 20 21 17 )
    (51 51 1)  simpleGrading (1 1 1) // 3
    
    hex ( 1 10 22 2 5 13 23 6 )
    zone_test (251 51 1)  simpleGrading (1 1 1) // 4
    
    hex ( 10 15 24 22 13 17 25 23 )
    zone_test (51 51 1)  simpleGrading (1 1 1) // 5
    
    hex ( 15 19 26 24 17 21 27 25 )
    (51 51 1)  simpleGrading (1 1 1) // 6
    
    hex ( 2 22 28 29 6 23 30 31 )
    (251 251 1)  simpleGrading (1 1 1) // 7
    
    hex ( 22 24 32 28 23 25 33 30 )
    zone_test (51 251 1)  simpleGrading (1 1 1) // 8
    
    hex ( 24 26 34 32 25 27 35 33 )
    (51 251 1)  simpleGrading (1 1 1) // 9
    
    hex ( 28 32 36 37 30 33 38 39 )
    zone_fluid (51 51 1)  simpleGrading (1 1 1) // 10
);

edges
(
    
);

boundary
(
    frontAndBack
    {
        type empty;
        faces
        (
            (4 5 6 7)
            (0 1 2 3)
            (11 12 13 5)
            (8 9 10 1)
            (12 16 17 13)
            (9 14 15 10)
            (16 20 21 17)
            (14 18 19 15)
            (5 13 23 6)
            (1 10 22 2)
            (13 17 25 23)
            (10 15 24 22)
            (17 21 27 25)
            (15 19 26 24)
            (6 23 30 31)
            (2 22 28 29)
            (23 25 33 30)
            (22 24 32 28)
            (25 27 35 33)
            (24 26 34 32)
            (30 33 38 39)
            (28 32 36 37)
            
        );

    }

    inlet
    {
        type patch;
        faces
        (
            (4 0 3 7)
            
        );

    }

    walls
    {
        type wall;
        faces
        (
            (4 5 1 0)
            (7 6 2 3)
            (11 12 9 8)
            (11 8 1 5)
            (12 16 14 9)
            (16 20 18 14)
            (20 18 19 21)
            (21 19 26 27)
            (31 30 28 29)
            (6 2 29 31)
            (33 35 34 32)
            (27 26 34 35)
            (30 28 37 39)
            (33 32 36 38)
            
        );

    }

    outlet
    {
        type patch;
        faces
        (
            (39 38 36 37)
            
        );

    }
);

mergePatchPairs
();

faces
();


// ************************************************************************* //
